month_dict = {1:'январь', 2:'февраль', 3:'март', 4:'апрель', 5:'май', 6:'июнь', 7:'июль', 8:'август', 9:'сентябрь', 10:'октябрь', 11:'ноябрь', 12:'декабрь'}
month = ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь', 'декабрь']


answer = input('Введите номер месяца и узнайте к какому времени года он относится ')
    if answer in month_dict:
        print(f'{answer} месяц года это {month_dict[answer]}')
        print(f'{answer} месяц года это {month[answer - 1]}')
    else:
        print('Введите номер от 1 до 12')
        
#Не понимаю, как мне исправить эту ошибку - все перепробовал
